Results/ReplicaCountAndLatency/frbs/ArangoDB/6.txt
/usr/bin/java  -classpath /home/ayush/work/GRACEBenchmarks/YCSB/conf:/home/ayush/work/GRACEBenchmarks/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/arangodb-binding-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/HdrHistogram-2.1.12.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/arangodb-java-driver-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/core-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/http-protocol-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-annotations-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-core-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-core-asl-1.9.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-databind-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-datatype-jakarta-jsonp-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-serde-json-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jakarta.json-api-2.1.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-buffer-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-dns-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-http-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-http2-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-socks-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-common-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-handler-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-handler-proxy-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-resolver-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-resolver-dns-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-transport-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/slf4j-api-1.7.25.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-auth-common-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-core-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-uri-template-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-web-client-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-web-common-4.5.7.jar site.ycsb.Client -t -db site.ycsb.db.ArangoDBClient -P workloads/workload_grace -p DBTYPE=arangodb -p DBURI=http://localhost:8529 -p REPLICATION_FACTOR=6 -p maxexecutiontime=180 -p threadcount=1 -p loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_load_vertices.json -p loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_load_edges.json -p vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_update_vertices.json -p edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_update_edges.json
Loaded 383940 vertices and 170075 edges
Initializing db: site.ycsb.db.ArangoDBClient
Using Database: site.ycsb.DBWrapper
Starting ArangoDB client
{deleteproportion=1, loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_load_edges.json, recordcount=10000, operationcount=20000000, loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_load_vertices.json, edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_update_edges.json, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, updateproportion=1, DBTYPE=arangodb, dotransactions=true, createproportion=1, REPLICATION_FACTOR=6, DBURI=http://localhost:8529, maxexecutiontime=180, vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/frbs_update_vertices.json, readallfields=true, db=site.ycsb.db.ArangoDBClient, requestdistribution=latest}
DBTYPE: arangodb
DBURI: http://localhost:8529
Connecting to ArangoDB database with params: localhost:8529
ArangoDB client initialized successfully
Connected to ArangoDB database successfully
[OVERALL], RunTime(ms), 180135
[OVERALL], Throughput(ops/sec), 0.42745718488911094
[TOTAL_GCS_G1_Young_Generation], Count, 7
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 488
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2709079301634885
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 488
[TOTAL_GC_TIME_%], Time(%), 0.2709079301634885
[REMOVE_VERTEX], Operations, 1
[REMOVE_VERTEX], AverageLatency(us), 705792.0
[REMOVE_VERTEX], MinLatency(us), 705536
[REMOVE_VERTEX], MaxLatency(us), 706047
[REMOVE_VERTEX], 50thPercentileLatency(us), 706047
[REMOVE_VERTEX], 95thPercentileLatency(us), 706047
[REMOVE_VERTEX], 99thPercentileLatency(us), 706047
[REMOVE_VERTEX], Return=OK, 1
[GET_EDGE_WITH_PROPERTY], Operations, 2
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 422144.0
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 417024
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 427263
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 417279
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 427263
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 427263
[GET_EDGE_WITH_PROPERTY], Return=OK, 2
[ADD_EDGE], Operations, 5
[ADD_EDGE], AverageLatency(us), 316185.6
[ADD_EDGE], MinLatency(us), 304896
[ADD_EDGE], MaxLatency(us), 354303
[ADD_EDGE], 50thPercentileLatency(us), 306943
[ADD_EDGE], 95thPercentileLatency(us), 354303
[ADD_EDGE], 99thPercentileLatency(us), 354303
[ADD_EDGE], Return=OK, 5
[ADD_VERTEX], Operations, 6
[ADD_VERTEX], AverageLatency(us), 705194.6666666666
[ADD_VERTEX], MinLatency(us), 704512
[ADD_VERTEX], MaxLatency(us), 706559
[ADD_VERTEX], 50thPercentileLatency(us), 705023
[ADD_VERTEX], 95thPercentileLatency(us), 706559
[ADD_VERTEX], 99thPercentileLatency(us), 706559
[ADD_VERTEX], Return=OK, 6
[GET_VERTEX_WITH_PROPERTY], Operations, 4
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 511136.0
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 473600
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 620031
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 474367
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 620031
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 620031
[GET_VERTEX_WITH_PROPERTY], Return=OK, 4
[REMOVE_EDGE_PROPERTY], Operations, 5
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 417049.6
[REMOVE_EDGE_PROPERTY], MinLatency(us), 408064
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 446463
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 409343
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 446463
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 446463
[REMOVE_EDGE_PROPERTY], Return=OK, 5
[REMOVE_EDGE], Operations, 4
[REMOVE_EDGE], AverageLatency(us), 306880.0
[REMOVE_EDGE], MinLatency(us), 304384
[REMOVE_EDGE], MaxLatency(us), 310015
[REMOVE_EDGE], 50thPercentileLatency(us), 304895
[REMOVE_EDGE], 95thPercentileLatency(us), 310015
[REMOVE_EDGE], 99thPercentileLatency(us), 310015
[REMOVE_EDGE], Return=OK, 4
[GET_EDGE_LABELS], Operations, 8
[GET_EDGE_LABELS], AverageLatency(us), 1.8944E7
[GET_EDGE_LABELS], MinLatency(us), 18759680
[GET_EDGE_LABELS], MaxLatency(us), 19693567
[GET_EDGE_LABELS], 50thPercentileLatency(us), 18841599
[GET_EDGE_LABELS], 95thPercentileLatency(us), 19693567
[GET_EDGE_LABELS], 99thPercentileLatency(us), 19693567
[GET_EDGE_LABELS], Return=OK, 8
[GET_VERTEX_COUNT], Operations, 8
[GET_VERTEX_COUNT], AverageLatency(us), 113828.0
[GET_VERTEX_COUNT], MinLatency(us), 103232
[GET_VERTEX_COUNT], MaxLatency(us), 182399
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 103615
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 182399
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 182399
[GET_VERTEX_COUNT], Return=OK, 8
[REMOVE_VERTEX_PROPERTY], Operations, 5
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 813107.2
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 807936
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 828927
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 809983
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 828927
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 828927
[REMOVE_VERTEX_PROPERTY], Return=OK, 5
[GET_EDGES_WITH_LABEL], Operations, 1
[GET_EDGES_WITH_LABEL], AverageLatency(us), 416896.0
[GET_EDGES_WITH_LABEL], MinLatency(us), 416768
[GET_EDGES_WITH_LABEL], MaxLatency(us), 417023
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 417023
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 417023
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 417023
[GET_EDGES_WITH_LABEL], Return=OK, 1
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3.0
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 3
[CLEANUP], 50thPercentileLatency(us), 3
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 3
[SET_EDGE_PROPERTY], Operations, 7
[SET_EDGE_PROPERTY], AverageLatency(us), 415250.28571428574
[SET_EDGE_PROPERTY], MinLatency(us), 407808
[SET_EDGE_PROPERTY], MaxLatency(us), 448767
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 410111
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 448767
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 448767
[SET_EDGE_PROPERTY], Return=OK, 7
[SET_VERTEX_PROPERTY], Operations, 7
[SET_VERTEX_PROPERTY], AverageLatency(us), 815652.5714285715
[SET_VERTEX_PROPERTY], MinLatency(us), 807936
[SET_VERTEX_PROPERTY], MaxLatency(us), 855551
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 809471
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 855551
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 855551
[SET_VERTEX_PROPERTY], Return=OK, 7
[GET_EDGE_COUNT], Operations, 7
[GET_EDGE_COUNT], AverageLatency(us), 104205.71428571429
[GET_EDGE_COUNT], MinLatency(us), 103424
[GET_EDGE_COUNT], MaxLatency(us), 105407
[GET_EDGE_COUNT], 50thPercentileLatency(us), 104063
[GET_EDGE_COUNT], 95thPercentileLatency(us), 105407
[GET_EDGE_COUNT], 99thPercentileLatency(us), 105407
[GET_EDGE_COUNT], Return=OK, 7